[{"year":"2024","day":"1","title":"Historian Hysteria","description":["The Chief Historian is always present for the big Christmas sleigh launch, but nobody has seen him in months! Last anyone heard, he was visiting locations that are historically significant to the North Pole; a group of Senior Historians has asked you to accompany them as they check the places they think he was most likely to visit.","As each location is checked, they will mark it on their list with a star. They figure the Chief Historian must be in one of the first fifty places they'll look, so in order to save Christmas, you need to help them get fifty stars on their list before Santa takes off on December 25th.","Collect stars by solving puzzles.  Two puzzles will be made available on each day in the Advent calendar; the second puzzle is unlocked when you complete the first.  Each puzzle grants one star. Good luck!","You haven't even left yet and the group of Elvish Senior Historians has already hit a problem: their list of locations to check is currently empty. Eventually, someone decides that the best place to check first would be the Chief Historian's office.","Upon pouring into the office, everyone confirms that the Chief Historian is indeed nowhere to be found. Instead, the Elves discover an assortment of notes and lists of historically significant locations! This seems to be the planning the Chief Historian was doing before he left. Perhaps these notes can be used to determine which locations to search?","Throughout the Chief's office, the historically significant locations are listed not by name but by a unique number called the location ID. To make sure they don't miss anything, The Historians split into two groups, each searching the office and trying to create their own complete list of location IDs.","There's just one problem: by holding the two lists up side by side (your puzzle input), it quickly becomes clear that the lists aren't very similar. Maybe you can help The Historians reconcile their lists?","For example:","3   4\n4   3\n2   5\n1   3\n3   9\n3   3","Maybe the lists are only off by a small amount! To find out, pair up the numbers and measure how far apart they are. Pair up the smallest number in the left list with the smallest number in the right list, then the second-smallest left number with the second-smallest right number, and so on.","Within each pair, figure out how far apart the two numbers are; you'll need to add up all of those distances. For example, if you pair up a 3 from the left list with a 7 from the right list, the distance apart is 4; if you pair up a 9 with a 3, the distance apart is 6.","In the example list above, the pairs and distances would be as follows:","The smallest number in the left list is 1, and the smallest number in the right list is 3. The distance between them is 2.\nThe second-smallest number in the left list is 2, and the second-smallest number in the right list is another 3. The distance between them is 1.\nThe third-smallest number in both lists is 3, so the distance between them is 0.\nThe next numbers to pair up are 3 and 4, a distance of 1.\nThe fifth-smallest numbers in each list are 3 and 5, a distance of 2.\nFinally, the largest number in the left list is 4, while the largest number in the right list is 9; these are a distance 5 apart.","To find the total distance between the left list and the right list, add up the distances between all of the pairs you found. In the example above, this is 2 + 1 + 0 + 1 + 2 + 5, a total distance of 11!","Your actual left and right lists contain many location IDs. What is the total distance between your lists?"],"blockCodes":[["3   4","4   3","2   5","1   3","3   9","3   3"]],"inlineCodes":["3","7","4","9","3","6","1","3","2","2","3","1","3","0","3","4","1","3","5","2","4","9","5","2 + 1 + 0 + 1 + 2 + 5","11"],"example":"3   4\n4   3\n2   5\n1   3\n3   9\n3   3\n"},{"year":"2024","day":"2","title":"Red-Nosed Reports","description":["Fortunately, the first location The Historians want to search isn't a long walk from the Chief Historian's office.","While the Red-Nosed Reindeer nuclear fusion/fission plant appears to contain no sign of the Chief Historian, the engineers there run up to you as soon as they see you. Apparently, they still talk about the time Rudolph was saved through molecular synthesis from a single electron.","They're quick to add that - since you're already here - they'd really appreciate your help analyzing some unusual data from the Red-Nosed reactor. You turn to check if The Historians are waiting for you, but they seem to have already divided into groups that are currently searching every corner of the facility. You offer to help with the unusual data.","The unusual data (your puzzle input) consists of many reports, one report per line. Each report is a list of numbers called levels that are separated by spaces. For example:","7 6 4 2 1\n1 2 7 8 9\n9 7 6 2 1\n1 3 2 4 5\n8 6 4 4 1\n1 3 6 7 9","This example data contains six reports each containing five levels.","The engineers are trying to figure out which reports are safe. The Red-Nosed reactor safety systems can only tolerate levels that are either gradually increasing or gradually decreasing. So, a report only counts as safe if both of the following are true:","The levels are either all increasing or all decreasing.\nAny two adjacent levels differ by at least one and at most three.","In the example above, the reports can be found safe or unsafe by checking those rules:","7 6 4 2 1: Safe because the levels are all decreasing by 1 or 2.\n1 2 7 8 9: Unsafe because 2 7 is an increase of 5.\n9 7 6 2 1: Unsafe because 6 2 is a decrease of 4.\n1 3 2 4 5: Unsafe because 1 3 is increasing but 3 2 is decreasing.\n8 6 4 4 1: Unsafe because 4 4 is neither an increase or a decrease.\n1 3 6 7 9: Safe because the levels are all increasing by 1, 2, or 3.","So, in this example, 2 reports are safe.","Analyze the unusual data from the engineers. How many reports are safe?"],"blockCodes":[["7 6 4 2 1","1 2 7 8 9","9 7 6 2 1","1 3 2 4 5","8 6 4 4 1","1 3 6 7 9"]],"inlineCodes":["7 6 4 2 1","1 2 7 8 9","2 7","9 7 6 2 1","6 2","1 3 2 4 5","1 3","3 2","8 6 4 4 1","4 4","1 3 6 7 9","2"],"example":"7 6 4 2 1\n1 2 7 8 9\n9 7 6 2 1\n1 3 2 4 5\n8 6 4 4 1\n1 3 6 7 9\n"},{"year":"2024","day":"3","title":"Mull It Over","description":["\"Our computers are having issues, so I have no idea if we have any Chief Historians in stock! You're welcome to check the warehouse, though,\" says the mildly flustered shopkeeper at the North Pole Toboggan Rental Shop. The Historians head out to take a look.","The shopkeeper turns to you. \"Any chance you can see why our computers are having issues again?\"","The computer appears to be trying to run a program, but its memory (your puzzle input) is corrupted. All of the instructions have been jumbled up!","It seems like the goal of the program is just to multiply some numbers. It does that with instructions like mul(X,Y), where X and Y are each 1-3 digit numbers. For instance, mul(44,46) multiplies 44 by 46 to get a result of 2024. Similarly, mul(123,4) would multiply 123 by 4.","However, because the program's memory has been corrupted, there are also many invalid characters that should be ignored, even if they look like part of a mul instruction. Sequences like mul(4*, mul(6,9!, ?(12,34), or mul ( 2 , 4 ) do nothing.","For example, consider the following section of corrupted memory:","xmul(2,4)%&mul[3,7]!@^do_not_mul(5,5)+mul(32,64]then(mul(11,8)mul(8,5))","Only the four highlighted sections are real mul instructions. Adding up the result of each instruction produces 161 (2*4 + 5*5 + 11*8 + 8*5).","Scan the corrupted memory for uncorrupted mul instructions. What do you get if you add up all of the results of the multiplications?"],"blockCodes":[["xmul(2,4)%&mul[3,7]!@^do_not_mul(5,5)+mul(32,64]then(mul(11,8)mul(8,5))"]],"inlineCodes":["mul(X,Y)","X","Y","mul(44,46)","44","46","2024","mul(123,4)","123","4","mul","mul(4*","mul(6,9!","?(12,34)","mul ( 2 , 4 )","mul","161","2*4 + 5*5 + 11*8 + 8*5","mul"],"example":"xmul(2,4)%&mul[3,7]!@^do_not_mul(5,5)+mul(32,64]then(mul(11,8)mul(8,5))"},{"year":"2024","day":"4","title":"Ceres Search","description":["\"Looks like the Chief's not here. Next!\" One of The Historians pulls out a device and pushes the only button on it. After a brief flash, you recognize the interior of the Ceres monitoring station!","As the search for the Chief continues, a small Elf who lives on the station tugs on your shirt; she'd like to know if you could help her with her word search (your puzzle input). She only has to find one word: XMAS.","This word search allows words to be horizontal, vertical, diagonal, written backwards, or even overlapping other words. It's a little unusual, though, as you don't merely need to find one instance of XMAS - you need to find all of them. Here are a few ways XMAS might appear, where irrelevant characters have been replaced with .:","","..X...\n.SAMX.\n.A..A.\nXMAS.S\n.X....","The actual word search will be full of letters instead. For example:","MMMSXXMASM\nMSAMXMSMSA\nAMXSXMAAMM\nMSAMASMSMX\nXMASAMXAMM\nXXAMMXXAMA\nSMSMSASXSS\nSAXAMASAAA\nMAMMMXMMMM\nMXMXAXMASX","In this word search, XMAS occurs a total of 18 times; here's the same word search again, but where letters not involved in any XMAS have been replaced with .:","....XXMAS.\n.SAMXMS...\n...S..A...\n..A.A.MS.X\nXMASAMX.MM\nX.....XA.A\nS.S.S.S.SS\n.A.A.A.A.A\n..M.M.M.MM\n.X.X.XMASX","Take a look at the little Elf's word search. How many times does XMAS appear?"],"blockCodes":[["..X...",".SAMX.",".A..A.","XMAS.S",".X...."],["MMMSXXMASM","MSAMXMSMSA","AMXSXMAAMM","MSAMASMSMX","XMASAMXAMM","XXAMMXXAMA","SMSMSASXSS","SAXAMASAAA","MAMMMXMMMM","MXMXAXMASX"],["....XXMAS.",".SAMXMS...","...S..A...","..A.A.MS.X","XMASAMX.MM","X.....XA.A","S.S.S.S.SS",".A.A.A.A.A","..M.M.M.MM",".X.X.XMASX"]],"inlineCodes":["XMAS","XMAS","XMAS",".","XMAS","18","XMAS",".","XMAS"],"example":"MMMSXXMASM\nMSAMXMSMSA\nAMXSXMAAMM\nMSAMASMSMX\nXMASAMXAMM\nXXAMMXXAMA\nSMSMSASXSS\nSAXAMASAAA\nMAMMMXMMMM\nMXMXAXMASX\n"},{"year":"2024","day":"5","title":"Print Queue","description":["Satisfied with their search on Ceres, the squadron of scholars suggests subsequently scanning the stationery stacks of sub-basement 17.","The North Pole printing department is busier than ever this close to Christmas, and while The Historians continue their search of this historically significant facility, an Elf operating a very familiar printer beckons you over.","The Elf must recognize you, because they waste no time explaining that the new sleigh launch safety manual updates won't print correctly. Failure to update the safety manuals would be dire indeed, so you offer your services.","Safety protocols clearly indicate that new pages for the safety manuals must be printed in a very specific order. The notation X|Y means that if both page number X and page number Y are to be produced as part of an update, page number X must be printed at some point before page number Y.","The Elf has for you both the page ordering rules and the pages to produce in each update (your puzzle input), but can't figure out whether each update has the pages in the right order.","For example:","47|53\n97|13\n97|61\n97|47\n75|29\n61|13\n75|53\n29|13\n97|29\n53|29\n61|53\n97|53\n61|29\n47|13\n75|47\n97|75\n47|61\n75|61\n47|29\n75|13\n53|13\n\n75,47,61,53,29\n97,61,53,29,13\n75,29,13\n75,97,47,61,53\n61,13,29\n97,13,75,29,47","The first section specifies the page ordering rules, one per line. The first rule, 47|53, means that if an update includes both page number 47 and page number 53, then page number 47 must be printed at some point before page number 53. (47 doesn't necessarily need to be immediately before 53; other pages are allowed to be between them.)","The second section specifies the page numbers of each update. Because most safety manuals are different, the pages needed in the updates are different too. The first update, 75,47,61,53,29, means that the update consists of page numbers 75, 47, 61, 53, and 29.","To get the printers going as soon as possible, start by identifying which updates are already in the right order.","In the above example, the first update (75,47,61,53,29) is in the right order:","75 is correctly first because there are rules that put each other page after it: 75|47, 75|61, 75|53, and 75|29.\n47 is correctly second because 75 must be before it (75|47) and every other page must be after it according to 47|61, 47|53, and 47|29.\n61 is correctly in the middle because 75 and 47 are before it (75|61 and 47|61) and 53 and 29 are after it (61|53 and 61|29).\n53 is correctly fourth because it is before page number 29 (53|29).\n29 is the only page left and so is correctly last.","Because the first update does not include some page numbers, the ordering rules involving those missing page numbers are ignored.","The second and third updates are also in the correct order according to the rules. Like the first update, they also do not include every page number, and so only some of the ordering rules apply - within each update, the ordering rules that involve missing page numbers are not used.","The fourth update, 75,97,47,61,53, is not in the correct order: it would print 75 before 97, which violates the rule 97|75.","The fifth update, 61,13,29, is also not in the correct order, since it breaks the rule 29|13.","The last update, 97,13,75,29,47, is not in the correct order due to breaking several rules.","For some reason, the Elves also need to know the middle page number of each update being printed. Because you are currently only printing the correctly-ordered updates, you will need to find the middle page number of each correctly-ordered update. In the above example, the correctly-ordered updates are:","75,47,61,53,29\n97,61,53,29,13\n75,29,13","These have middle page numbers of 61, 53, and 29 respectively. Adding these page numbers together gives 143.","Of course, you'll need to be careful: the actual list of page ordering rules is bigger and more complicated than the above example.","Determine which updates are already in the correct order. What do you get if you add up the middle page number from those correctly-ordered updates?"],"blockCodes":[["47|53","97|13","97|61","97|47","75|29","61|13","75|53","29|13","97|29","53|29","61|53","97|53","61|29","47|13","75|47","97|75","47|61","75|61","47|29","75|13","53|13","","75,47,61,53,29","97,61,53,29,13","75,29,13","75,97,47,61,53","61,13,29","97,13,75,29,47"],["75,47,61,53,29","97,61,53,29,13","75,29,13"]],"inlineCodes":["X|Y","X","Y","X","Y","47|53","75,47,61,53,29","75,47,61,53,29","75","75|47","75|61","75|53","75|29","47","75|47","47|61","47|53","47|29","61","75|61","47|61","61|53","61|29","53","53|29","29","75,97,47,61,53","97|75","61,13,29","29|13","97,13,75,29,47","61","53","29","143"],"example":"47|53\n97|13\n97|61\n97|47\n75|29\n61|13\n75|53\n29|13\n97|29\n53|29\n61|53\n97|53\n61|29\n47|13\n75|47\n97|75\n47|61\n75|61\n47|29\n75|13\n53|13\n\n75,47,61,53,29\n97,61,53,29,13\n75,29,13\n75,97,47,61,53\n61,13,29\n97,13,75,29,47\n"},{"year":"2024","day":"6","title":"Guard Gallivant","description":["The Historians use their fancy device again, this time to whisk you all away to the North Pole prototype suit manufacturing lab... in the year 1518! It turns out that having direct access to history is very convenient for a group of historians.","You still have to be careful of time paradoxes, and so it will be important to avoid anyone from 1518 while The Historians search for the Chief. Unfortunately, a single guard is patrolling this part of the lab.","Maybe you can work out where the guard will go ahead of time so that The Historians can search safely?","You start by making a map (your puzzle input) of the situation. For example:","....#.....\n.........#\n..........\n..#.......\n.......#..\n..........\n.#..^.....\n........#.\n#.........\n......#...","The map shows the current position of the guard with ^ (to indicate the guard is currently facing up from the perspective of the map). Any obstructions - crates, desks, alchemical reactors, etc. - are shown as #.","Lab guards in 1518 follow a very strict patrol protocol which involves repeatedly following these steps:","If there is something directly in front of you, turn right 90 degrees.\nOtherwise, take a step forward.","Following the above protocol, the guard moves up several times until she reaches an obstacle (in this case, a pile of failed suit prototypes):","....#.....\n....^....#\n..........\n..#.......\n.......#..\n..........\n.#........\n........#.\n#.........\n......#...","Because there is now an obstacle in front of the guard, she turns right before continuing straight in her new facing direction:","....#.....\n........>#\n..........\n..#.......\n.......#..\n..........\n.#........\n........#.\n#.........\n......#...","Reaching another obstacle (a spool of several very long polymers), she turns right again and continues downward:","....#.....\n.........#\n..........\n..#.......\n.......#..\n..........\n.#......v.\n........#.\n#.........\n......#...","This process continues for a while, but the guard eventually leaves the mapped area (after walking past a tank of universal solvent):","....#.....\n.........#\n..........\n..#.......\n.......#..\n..........\n.#........\n........#.\n#.........\n......#v..","By predicting the guard's route, you can determine which specific positions in the lab will be in the patrol path. Including the guard's starting position, the positions visited by the guard before leaving the area are marked with an X:","....#.....\n....XXXXX#\n....X...X.\n..#.X...X.\n..XXXXX#X.\n..X.X.X.X.\n.#XXXXXXX.\n.XXXXXXX#.\n#XXXXXXX..\n......#X..","In this example, the guard will visit 41 distinct positions on your map.","Predict the path of the guard. How many distinct positions will the guard visit before leaving the mapped area?"],"blockCodes":[["....#.....",".........#","..........","..#.......",".......#..","..........",".#..^.....","........#.","#.........","......#..."],["....#.....","....^....#","..........","..#.......",".......#..","..........",".#........","........#.","#.........","......#..."],["....#.....","........>#","..........","..#.......",".......#..","..........",".#........","........#.","#.........","......#..."],["....#.....",".........#","..........","..#.......",".......#..","..........",".#......v.","........#.","#.........","......#..."],["....#.....",".........#","..........","..#.......",".......#..","..........",".#........","........#.","#.........","......#v.."],["....#.....","....XXXXX#","....X...X.","..#.X...X.","..XXXXX#X.","..X.X.X.X.",".#XXXXXXX.",".XXXXXXX#.","#XXXXXXX..","......#X.."]],"inlineCodes":["^","#","X","41"],"example":"....#.....\n.........#\n..........\n..#.......\n.......#..\n..........\n.#..^.....\n........#.\n#.........\n......#...\n"},{"year":"2024","day":"7","title":"Bridge Repair","description":["The Historians take you to a familiar rope bridge over a river in the middle of a jungle. The Chief isn't on this side of the bridge, though; maybe he's on the other side?","When you go to cross the bridge, you notice a group of engineers trying to repair it. (Apparently, it breaks pretty frequently.) You won't be able to cross until it's fixed.","You ask how long it'll take; the engineers tell you that it only needs final calibrations, but some young elephants were playing nearby and stole all the operators from their calibration equations! They could finish the calibrations if only someone could determine which test values could possibly be produced by placing any combination of operators into their calibration equations (your puzzle input).","For example:","190: 10 19\n3267: 81 40 27\n83: 17 5\n156: 15 6\n7290: 6 8 6 15\n161011: 16 10 13\n192: 17 8 14\n21037: 9 7 18 13\n292: 11 6 16 20","Each line represents a single equation. The test value appears before the colon on each line; it is your job to determine whether the remaining numbers can be combined with operators to produce the test value.","Operators are always evaluated left-to-right, not according to precedence rules. Furthermore, numbers in the equations cannot be rearranged. Glancing into the jungle, you can see elephants holding two different types of operators: add (+) and multiply (*).","Only three of the above equations can be made true by inserting operators:","190: 10 19 has only one position that accepts an operator: between 10 and 19. Choosing + would give 29, but choosing * would give the test value (10 * 19 = 190).\n3267: 81 40 27 has two positions for operators. Of the four possible configurations of the operators, two cause the right side to match the test value: 81 + 40 * 27 and 81 * 40 + 27 both equal 3267 (when evaluated left-to-right)!\n292: 11 6 16 20 can be solved in exactly one way: 11 + 6 * 16 + 20.","The engineers just need the total calibration result, which is the sum of the test values from just the equations that could possibly be true. In the above example, the sum of the test values for the three equations listed above is 3749.","Determine which equations could possibly be true. What is their total calibration result?"],"blockCodes":[["190: 10 19","3267: 81 40 27","83: 17 5","156: 15 6","7290: 6 8 6 15","161011: 16 10 13","192: 17 8 14","21037: 9 7 18 13","292: 11 6 16 20"]],"inlineCodes":["+","*","190: 10 19","10","19","+","29","*","10 * 19 = 190","3267: 81 40 27","81 + 40 * 27","81 * 40 + 27","3267","292: 11 6 16 20","11 + 6 * 16 + 20","3749"],"example":"190: 10 19\n3267: 81 40 27\n83: 17 5\n156: 15 6\n7290: 6 8 6 15\n161011: 16 10 13\n192: 17 8 14\n21037: 9 7 18 13\n292: 11 6 16 20\n"},{"year":"2024","day":"8","title":"Resonant Collinearity","description":["You find yourselves on the roof of a top-secret Easter Bunny installation.","While The Historians do their thing, you take a look at the familiar huge antenna. Much to your surprise, it seems to have been reconfigured to emit a signal that makes people 0.1% more likely to buy Easter Bunny brand Imitation Mediocre Chocolate as a Christmas gift! Unthinkable!","Scanning across the city, you find that there are actually many such antennas. Each antenna is tuned to a specific frequency indicated by a single lowercase letter, uppercase letter, or digit. You create a map (your puzzle input) of these antennas. For example:","............\n........0...\n.....0......\n.......0....\n....0.......\n......A.....\n............\n............\n........A...\n.........A..\n............\n............","The signal only applies its nefarious effect at specific antinodes based on the resonant frequencies of the antennas. In particular, an antinode occurs at any point that is perfectly in line with two antennas of the same frequency - but only when one of the antennas is twice as far away as the other. This means that for any pair of antennas with the same frequency, there are two antinodes, one on either side of them.","So, for these two antennas with frequency a, they create the two antinodes marked with #:","..........\n...#......\n..........\n....a.....\n..........\n.....a....\n..........\n......#...\n..........\n..........","Adding a third antenna with the same frequency creates several more antinodes. It would ideally add four antinodes, but two are off the right side of the map, so instead it adds only two:","..........\n...#......\n#.........\n....a.....\n........a.\n.....a....\n..#.......\n......#...\n..........\n..........","Antennas with different frequencies don't create antinodes; A and a count as different frequencies. However, antinodes can occur at locations that contain antennas. In this diagram, the lone antenna with frequency capital A creates no antinodes but has a lowercase-a-frequency antinode at its location:","..........\n...#......\n#.........\n....a.....\n........a.\n.....a....\n..#.......\n......A...\n..........\n..........","The first example has antennas with two different frequencies, so the antinodes they create look like this, plus an antinode overlapping the topmost A-frequency antenna:","......#....#\n...#....0...\n....#0....#.\n..#....0....\n....0....#..\n.#....A.....\n...#........\n#......#....\n........A...\n.........A..\n..........#.\n..........#.","Because the topmost A-frequency antenna overlaps with a 0-frequency antinode, there are 14 total unique locations that contain an antinode within the bounds of the map.","Calculate the impact of the signal. How many unique locations within the bounds of the map contain an antinode?"],"blockCodes":[["............","........0...",".....0......",".......0....","....0.......","......A.....","............","............","........A...",".........A..","............","............"],["..........","...#......","..........","....a.....","..........",".....a....","..........","......#...","..........",".........."],["..........","...#......","#.........","....a.....","........a.",".....a....","..#.......","......#...","..........",".........."],["..........","...#......","#.........","....a.....","........a.",".....a....","..#.......","......A...","..........",".........."],["......#....#","...#....0...","....#0....#.","..#....0....","....0....#..",".#....A.....","...#........","#......#....","........A...",".........A..","..........#.","..........#."]],"inlineCodes":["a","#","A","a","A","a","A","A","0","14"],"example":"............\n........0...\n.....0......\n.......0....\n....0.......\n......A.....\n............\n............\n........A...\n.........A..\n............\n............\n"},{"year":"2024","day":"9","title":"Disk Fragmenter","description":["Another push of the button leaves you in the familiar hallways of some friendly amphipods! Good thing you each somehow got your own personal mini submarine. The Historians jet away in search of the Chief, mostly by driving directly into walls.","While The Historians quickly figure out how to pilot these things, you notice an amphipod in the corner struggling with his computer. He's trying to make more contiguous free space by compacting all of the files, but his program isn't working; you offer to help.","He shows you the disk map (your puzzle input) he's already generated. For example:","2333133121414131402","The disk map uses a dense format to represent the layout of files and free space on the disk. The digits alternate between indicating the length of a file and the length of free space.","So, a disk map like 12345 would represent a one-block file, two blocks of free space, a three-block file, four blocks of free space, and then a five-block file. A disk map like 90909 would represent three nine-block files in a row (with no free space between them).","Each file on disk also has an ID number based on the order of the files as they appear before they are rearranged, starting with ID 0. So, the disk map 12345 has three files: a one-block file with ID 0, a three-block file with ID 1, and a five-block file with ID 2. Using one character for each block where digits are the file ID and . is free space, the disk map 12345 represents these individual blocks:","0..111....22222","The first example above, 2333133121414131402, represents these individual blocks:","00...111...2...333.44.5555.6666.777.888899","The amphipod would like to move file blocks one at a time from the end of the disk to the leftmost free space block (until there are no gaps remaining between file blocks). For the disk map 12345, the process looks like this:","0..111....22222\n02.111....2222.\n022111....222..\n0221112...22...\n02211122..2....\n022111222......","The first example requires a few more steps:","00...111...2...333.44.5555.6666.777.888899\n009..111...2...333.44.5555.6666.777.88889.\n0099.111...2...333.44.5555.6666.777.8888..\n00998111...2...333.44.5555.6666.777.888...\n009981118..2...333.44.5555.6666.777.88....\n0099811188.2...333.44.5555.6666.777.8.....\n009981118882...333.44.5555.6666.777.......\n0099811188827..333.44.5555.6666.77........\n00998111888277.333.44.5555.6666.7.........\n009981118882777333.44.5555.6666...........\n009981118882777333644.5555.666............\n00998111888277733364465555.66.............\n0099811188827773336446555566..............","The final step of this file-compacting process is to update the filesystem checksum. To calculate the checksum, add up the result of multiplying each of these blocks' position with the file ID number it contains. The leftmost block is in position 0. If a block contains free space, skip it instead.","Continuing the first example, the first few blocks' position multiplied by its file ID number are 0 * 0 = 0, 1 * 0 = 0, 2 * 9 = 18, 3 * 9 = 27, 4 * 8 = 32, and so on. In this example, the checksum is the sum of these, 1928.","Compact the amphipod's hard drive using the process he requested. What is the resulting filesystem checksum? (Be careful copy/pasting the input for this puzzle; it is a single, very long line.)"],"blockCodes":[["2333133121414131402"],["0..111....22222"],["00...111...2...333.44.5555.6666.777.888899"],["0..111....22222","02.111....2222.","022111....222..","0221112...22...","02211122..2....","022111222......"],["00...111...2...333.44.5555.6666.777.888899","009..111...2...333.44.5555.6666.777.88889.","0099.111...2...333.44.5555.6666.777.8888..","00998111...2...333.44.5555.6666.777.888...","009981118..2...333.44.5555.6666.777.88....","0099811188.2...333.44.5555.6666.777.8.....","009981118882...333.44.5555.6666.777.......","0099811188827..333.44.5555.6666.77........","00998111888277.333.44.5555.6666.7.........","009981118882777333.44.5555.6666...........","009981118882777333644.5555.666............","00998111888277733364465555.66.............","0099811188827773336446555566.............."]],"inlineCodes":["12345","90909","0","12345","0","1","2",".","12345","2333133121414131402","12345","0","0 * 0 = 0","1 * 0 = 0","2 * 9 = 18","3 * 9 = 27","4 * 8 = 32","1928"],"example":"2333133121414131402"},{"year":"2024","day":"10","title":"Hoof It","description":["You all arrive at a Lava Production Facility on a floating island in the sky. As the others begin to search the massive industrial complex, you feel a small nose boop your leg and look down to discover a reindeer wearing a hard hat.","The reindeer is holding a book titled \"Lava Island Hiking Guide\". However, when you open the book, you discover that most of it seems to have been scorched by lava! As you're about to ask how you can help, the reindeer brings you a blank topographic map of the surrounding area (your puzzle input) and looks up at you excitedly.","Perhaps you can help fill in the missing hiking trails?","The topographic map indicates the height at each position using a scale from 0 (lowest) to 9 (highest). For example:","0123\n1234\n8765\n9876","Based on un-scorched scraps of the book, you determine that a good hiking trail is as long as possible and has an even, gradual, uphill slope. For all practical purposes, this means that a hiking trail is any path that starts at height 0, ends at height 9, and always increases by a height of exactly 1 at each step. Hiking trails never include diagonal steps - only up, down, left, or right (from the perspective of the map).","You look up from the map and notice that the reindeer has helpfully begun to construct a small pile of pencils, markers, rulers, compasses, stickers, and other equipment you might need to update the map with hiking trails.","A trailhead is any position that starts one or more hiking trails - here, these positions will always have height 0. Assembling more fragments of pages, you establish that a trailhead's score is the number of 9-height positions reachable from that trailhead via a hiking trail. In the above example, the single trailhead in the top left corner has a score of 1 because it can reach a single 9 (the one in the bottom left).","This trailhead has a score of 2:","...0...\n...1...\n...2...\n6543456\n7.....7\n8.....8\n9.....9","(The positions marked . are impassable tiles to simplify these examples; they do not appear on your actual topographic map.)","This trailhead has a score of 4 because every 9 is reachable via a hiking trail except the one immediately to the left of the trailhead:","..90..9\n...1.98\n...2..7\n6543456\n765.987\n876....\n987....","This topographic map contains two trailheads; the trailhead at the top has a score of 1, while the trailhead at the bottom has a score of 2:","10..9..\n2...8..\n3...7..\n4567654\n...8..3\n...9..2\n.....01","Here's a larger example:","89010123\n78121874\n87430965\n96549874\n45678903\n32019012\n01329801\n10456732","This larger example has 9 trailheads. Considering the trailheads in reading order, they have scores of 5, 6, 5, 3, 1, 3, 5, 3, and 5. Adding these scores together, the sum of the scores of all trailheads is 36.","The reindeer gleefully carries over a protractor and adds it to the pile. What is the sum of the scores of all trailheads on your topographic map?"],"blockCodes":[["0123","1234","8765","9876"],["...0...","...1...","...2...","6543456","7.....7","8.....8","9.....9"],["..90..9","...1.98","...2..7","6543456","765.987","876....","987...."],["10..9..","2...8..","3...7..","4567654","...8..3","...9..2",".....01"],["89010123","78121874","87430965","96549874","45678903","32019012","01329801","10456732"]],"inlineCodes":["0","9","0","9","0","9","1","9","2",".","4","9","1","2","5","6","5","3","1","3","5","3","5","36"],"example":"0123\n1234\n8765\n9876\n"},{"year":"2024","day":"11","title":"Plutonian Pebbles","description":["The ancient civilization on Pluto was known for its ability to manipulate spacetime, and while The Historians explore their infinite corridors, you've noticed a strange set of physics-defying stones.","At first glance, they seem like normal stones: they're arranged in a perfectly straight line, and each stone has a number engraved on it.","The strange part is that every time you blink, the stones change.","Sometimes, the number engraved on a stone changes. Other times, a stone might split in two, causing all the other stones to shift over a bit to make room in their perfectly straight line.","As you observe them for a while, you find that the stones have a consistent behavior. Every time you blink, the stones each simultaneously change according to the first applicable rule in this list:","If the stone is engraved with the number 0, it is replaced by a stone engraved with the number 1.\nIf the stone is engraved with a number that has an even number of digits, it is replaced by two stones. The left half of the digits are engraved on the new left stone, and the right half of the digits are engraved on the new right stone. (The new numbers don't keep extra leading zeroes: 1000 would become stones 10 and 0.)\nIf none of the other rules apply, the stone is replaced by a new stone; the old stone's number multiplied by 2024 is engraved on the new stone.","No matter how the stones change, their order is preserved, and they stay on their perfectly straight line.","How will the stones evolve if you keep blinking at them? You take a note of the number engraved on each stone in the line (your puzzle input).","If you have an arrangement of five stones engraved with the numbers 0 1 10 99 999 and you blink once, the stones transform as follows:","The first stone, 0, becomes a stone marked 1.\nThe second stone, 1, is multiplied by 2024 to become 2024.\nThe third stone, 10, is split into a stone marked 1 followed by a stone marked 0.\nThe fourth stone, 99, is split into two stones marked 9.\nThe fifth stone, 999, is replaced by a stone marked 2021976.","So, after blinking once, your five stones would become an arrangement of seven stones engraved with the numbers 1 2024 1 0 9 9 2021976.","Here is a longer example:","Initial arrangement:\n125 17\n\nAfter 1 blink:\n253000 1 7\n\nAfter 2 blinks:\n253 0 2024 14168\n\nAfter 3 blinks:\n512072 1 20 24 28676032\n\nAfter 4 blinks:\n512 72 2024 2 0 2 4 2867 6032\n\nAfter 5 blinks:\n1036288 7 2 20 24 4048 1 4048 8096 28 67 60 32\n\nAfter 6 blinks:\n2097446912 14168 4048 2 0 2 4 40 48 2024 40 48 80 96 2 8 6 7 6 0 3 2","In this example, after blinking six times, you would have 22 stones. After blinking 25 times, you would have 55312 stones!","Consider the arrangement of stones in front of you. How many stones will you have after blinking 25 times?"],"blockCodes":[["Initial arrangement:","125 17","","After 1 blink:","253000 1 7","","After 2 blinks:","253 0 2024 14168","","After 3 blinks:","512072 1 20 24 28676032","","After 4 blinks:","512 72 2024 2 0 2 4 2867 6032","","After 5 blinks:","1036288 7 2 20 24 4048 1 4048 8096 28 67 60 32","","After 6 blinks:","2097446912 14168 4048 2 0 2 4 40 48 2024 40 48 80 96 2 8 6 7 6 0 3 2"]],"inlineCodes":["0","1","1000","10","0","0 1 10 99 999","0","1","1","2024","10","1","0","99","9","999","2021976","1 2024 1 0 9 9 2021976","22","55312"],"example":null},{"year":"2024","day":"12","title":"Garden Groups","description":["Why not search for the Chief Historian near the gardener and his massive farm? There's plenty of food, so The Historians grab something to eat while they search.","You're about to settle near a complex arrangement of garden plots when some Elves ask if you can lend a hand. They'd like to set up fences around each region of garden plots, but they can't figure out how much fence they need to order or how much it will cost. They hand you a map (your puzzle input) of the garden plots.","Each garden plot grows only a single type of plant and is indicated by a single letter on your map. When multiple garden plots are growing the same type of plant and are touching (horizontally or vertically), they form a region. For example:","AAAA\nBBCD\nBBCC\nEEEC","This 4x4 arrangement includes garden plots growing five different types of plants (labeled A, B, C, D, and E), each grouped into their own region.","In order to accurately calculate the cost of the fence around a single region, you need to know that region's area and perimeter.","The area of a region is simply the number of garden plots the region contains. The above map's type A, B, and C plants are each in a region of area 4. The type E plants are in a region of area 3; the type D plants are in a region of area 1.","Each garden plot is a square and so has four sides. The perimeter of a region is the number of sides of garden plots in the region that do not touch another garden plot in the same region. The type A and C plants are each in a region with perimeter 10. The type B and E plants are each in a region with perimeter 8. The lone D plot forms its own region with perimeter 4.","Visually indicating the sides of plots in each region that contribute to the perimeter using - and |, the above map's regions' perimeters are measured as follows:","+-+-+-+-+\n|A A A A|\n+-+-+-+-+     +-+\n              |D|\n+-+-+   +-+   +-+\n|B B|   |C|\n+   +   + +-+\n|B B|   |C C|\n+-+-+   +-+ +\n          |C|\n+-+-+-+   +-+\n|E E E|\n+-+-+-+","Plants of the same type can appear in multiple separate regions, and regions can even appear within other regions. For example:","OOOOO\nOXOXO\nOOOOO\nOXOXO\nOOOOO","The above map contains five regions, one containing all of the O garden plots, and the other four each containing a single X plot.","The four X regions each have area 1 and perimeter 4. The region containing 21 type O plants is more complicated; in addition to its outer edge contributing a perimeter of 20, its boundary with each X region contributes an additional 4 to its perimeter, for a total perimeter of 36.","Due to \"modern\" business practices, the price of fence required for a region is found by multiplying that region's area by its perimeter. The total price of fencing all regions on a map is found by adding together the price of fence for every region on the map.","In the first example, region A has price 4 * 10 = 40, region B has price 4 * 8 = 32, region C has price 4 * 10 = 40, region D has price 1 * 4 = 4, and region E has price 3 * 8 = 24. So, the total price for the first example is 140.","In the second example, the region with all of the O plants has price 21 * 36 = 756, and each of the four smaller X regions has price 1 * 4 = 4, for a total price of 772 (756 + 4 + 4 + 4 + 4).","Here's a larger example:","RRRRIICCFF\nRRRRIICCCF\nVVRRRCCFFF\nVVRCCCJFFF\nVVVVCJJCFE\nVVIVCCJJEE\nVVIIICJJEE\nMIIIIIJJEE\nMIIISIJEEE\nMMMISSJEEE","It contains:","A region of R plants with price 12 * 18 = 216.\nA region of I plants with price 4 * 8 = 32.\nA region of C plants with price 14 * 28 = 392.\nA region of F plants with price 10 * 18 = 180.\nA region of V plants with price 13 * 20 = 260.\nA region of J plants with price 11 * 20 = 220.\nA region of C plants with price 1 * 4 = 4.\nA region of E plants with price 13 * 18 = 234.\nA region of I plants with price 14 * 22 = 308.\nA region of M plants with price 5 * 12 = 60.\nA region of S plants with price 3 * 8 = 24.","So, it has a total price of 1930.","What is the total price of fencing all regions on your map?"],"blockCodes":[["AAAA","BBCD","BBCC","EEEC"],["+-+-+-+-+","|A A A A|","+-+-+-+-+     +-+","              |D|","+-+-+   +-+   +-+","|B B|   |C|","+   +   + +-+","|B B|   |C C|","+-+-+   +-+ +","          |C|","+-+-+-+   +-+","|E E E|","+-+-+-+"],["OOOOO","OXOXO","OOOOO","OXOXO","OOOOO"],["RRRRIICCFF","RRRRIICCCF","VVRRRCCFFF","VVRCCCJFFF","VVVVCJJCFE","VVIVCCJJEE","VVIIICJJEE","MIIIIIJJEE","MIIISIJEEE","MMMISSJEEE"]],"inlineCodes":["A","B","C","D","E","A","B","C","4","E","3","D","1","A","C","10","B","E","8","D","4","-","|","O","X","X","1","4","21","O","20","X","4","36","A","4 * 10 = 40","B","4 * 8 = 32","C","4 * 10 = 40","D","1 * 4 = 4","E","3 * 8 = 24","140","O","21 * 36 = 756","X","1 * 4 = 4","772","756 + 4 + 4 + 4 + 4","R","12 * 18 = 216","I","4 * 8 = 32","C","14 * 28 = 392","F","10 * 18 = 180","V","13 * 20 = 260","J","11 * 20 = 220","C","1 * 4 = 4","E","13 * 18 = 234","I","14 * 22 = 308","M","5 * 12 = 60","S","3 * 8 = 24","1930"],"example":"AAAA\nBBCD\nBBCC\nEEEC\n"},{"year":"2024","day":"13","title":"Claw Contraption","description":["Next up: the lobby of a resort on a tropical island. The Historians take a moment to admire the hexagonal floor tiles before spreading out.","Fortunately, it looks like the resort has a new arcade! Maybe you can win some prizes from the claw machines?","The claw machines here are a little unusual. Instead of a joystick or directional buttons to control the claw, these machines have two buttons labeled A and B. Worse, you can't just put in a token and play; it costs 3 tokens to push the A button and 1 token to push the B button.","With a little experimentation, you figure out that each machine's buttons are configured to move the claw a specific amount to the right (along the X axis) and a specific amount forward (along the Y axis) each time that button is pressed.","Each machine contains one prize; to win the prize, the claw must be positioned exactly above the prize on both the X and Y axes.","You wonder: what is the smallest number of tokens you would have to spend to win as many prizes as possible? You assemble a list of every machine's button behavior and prize location (your puzzle input). For example:","Button A: X+94, Y+34\nButton B: X+22, Y+67\nPrize: X=8400, Y=5400\n\nButton A: X+26, Y+66\nButton B: X+67, Y+21\nPrize: X=12748, Y=12176\n\nButton A: X+17, Y+86\nButton B: X+84, Y+37\nPrize: X=7870, Y=6450\n\nButton A: X+69, Y+23\nButton B: X+27, Y+71\nPrize: X=18641, Y=10279","This list describes the button configuration and prize location of four different claw machines.","For now, consider just the first claw machine in the list:","Pushing the machine's A button would move the claw 94 units along the X axis and 34 units along the Y axis.\nPushing the B button would move the claw 22 units along the X axis and 67 units along the Y axis.\nThe prize is located at X=8400, Y=5400; this means that from the claw's initial position, it would need to move exactly 8400 units along the X axis and exactly 5400 units along the Y axis to be perfectly aligned with the prize in this machine.","The cheapest way to win the prize is by pushing the A button 80 times and the B button 40 times. This would line up the claw along the X axis (because 80*94 + 40*22 = 8400) and along the Y axis (because 80*34 + 40*67 = 5400). Doing this would cost 80*3 tokens for the A presses and 40*1 for the B presses, a total of 280 tokens.","For the second and fourth claw machines, there is no combination of A and B presses that will ever win a prize.","For the third claw machine, the cheapest way to win the prize is by pushing the A button 38 times and the B button 86 times. Doing this would cost a total of 200 tokens.","So, the most prizes you could possibly win is two; the minimum tokens you would have to spend to win all (two) prizes is 480.","You estimate that each button would need to be pressed no more than 100 times to win a prize. How else would someone be expected to play?","Figure out how to win as many prizes as possible. What is the fewest tokens you would have to spend to win all possible prizes?"],"blockCodes":[["Button A: X+94, Y+34","Button B: X+22, Y+67","Prize: X=8400, Y=5400","","Button A: X+26, Y+66","Button B: X+67, Y+21","Prize: X=12748, Y=12176","","Button A: X+17, Y+86","Button B: X+84, Y+37","Prize: X=7870, Y=6450","","Button A: X+69, Y+23","Button B: X+27, Y+71","Prize: X=18641, Y=10279"]],"inlineCodes":["A","B","A","B","X","Y","X","Y","A","94","X","34","Y","B","22","X","67","Y","X=8400","Y=5400","8400","X","5400","Y","A","80","B","40","X","80*94 + 40*22 = 8400","Y","80*34 + 40*67 = 5400","80*3","A","40*1","B","280","A","38","B","86","200","480","100"],"example":"Button A: X+94, Y+34\nButton B: X+22, Y+67\nPrize: X=8400, Y=5400\n\nButton A: X+26, Y+66\nButton B: X+67, Y+21\nPrize: X=12748, Y=12176\n\nButton A: X+17, Y+86\nButton B: X+84, Y+37\nPrize: X=7870, Y=6450\n\nButton A: X+69, Y+23\nButton B: X+27, Y+71\nPrize: X=18641, Y=10279\n"},{"year":"2024","day":"14","title":"Restroom Redoubt","description":["One of The Historians needs to use the bathroom; fortunately, you know there's a bathroom near an unvisited location on their list, and so you're all quickly teleported directly to the lobby of Easter Bunny Headquarters.","Unfortunately, EBHQ seems to have \"improved\" bathroom security again after your last visit. The area outside the bathroom is swarming with robots!","To get The Historian safely to the bathroom, you'll need a way to predict where the robots will be in the future. Fortunately, they all seem to be moving on the tile floor in predictable straight lines.","You make a list (your puzzle input) of all of the robots' current positions (p) and velocities (v), one robot per line. For example:","p=0,4 v=3,-3\np=6,3 v=-1,-3\np=10,3 v=-1,2\np=2,0 v=2,-1\np=0,0 v=1,3\np=3,0 v=-2,-2\np=7,6 v=-1,-3\np=3,0 v=-1,-2\np=9,3 v=2,3\np=7,3 v=-1,2\np=2,4 v=2,-3\np=9,5 v=-3,-3","Each robot's position is given as p=x,y where x represents the number of tiles the robot is from the left wall and y represents the number of tiles from the top wall (when viewed from above). So, a position of p=0,0 means the robot is all the way in the top-left corner.","Each robot's velocity is given as v=x,y where x and y are given in tiles per second. Positive x means the robot is moving to the right, and positive y means the robot is moving down. So, a velocity of v=1,-2 means that each second, the robot moves 1 tile to the right and 2 tiles up.","The robots outside the actual bathroom are in a space which is 101 tiles wide and 103 tiles tall (when viewed from above). However, in this example, the robots are in a space which is only 11 tiles wide and 7 tiles tall.","The robots are good at navigating over/under each other (due to a combination of springs, extendable legs, and quadcopters), so they can share the same tile and don't interact with each other. Visually, the number of robots on each tile in this example looks like this:","1.12.......\n...........\n...........\n......11.11\n1.1........\n.........1.\n.......1...","These robots have a unique feature for maximum bathroom security: they can teleport. When a robot would run into an edge of the space they're in, they instead teleport to the other side, effectively wrapping around the edges. Here is what robot p=2,4 v=2,-3 does for the first few seconds:","Initial state:\n...........\n...........\n...........\n...........\n..1........\n...........\n...........\n\nAfter 1 second:\n...........\n....1......\n...........\n...........\n...........\n...........\n...........\n\nAfter 2 seconds:\n...........\n...........\n...........\n...........\n...........\n......1....\n...........\n\nAfter 3 seconds:\n...........\n...........\n........1..\n...........\n...........\n...........\n...........\n\nAfter 4 seconds:\n...........\n...........\n...........\n...........\n...........\n...........\n..........1\n\nAfter 5 seconds:\n...........\n...........\n...........\n.1.........\n...........\n...........\n...........","The Historian can't wait much longer, so you don't have to simulate the robots for very long. Where will the robots be after 100 seconds?","In the above example, the number of robots on each tile after 100 seconds has elapsed looks like this:","......2..1.\n...........\n1..........\n.11........\n.....1.....\n...12......\n.1....1....","To determine the safest area, count the number of robots in each quadrant after 100 seconds. Robots that are exactly in the middle (horizontally or vertically) don't count as being in any quadrant, so the only relevant robots are:","..... 2..1.\n..... .....\n1.... .....\n           \n..... .....\n...12 .....\n.1... 1....","In this example, the quadrants contain 1, 3, 4, and 1 robot. Multiplying these together gives a total safety factor of 12.","Predict the motion of the robots in your list within a space which is 101 tiles wide and 103 tiles tall. What will the safety factor be after exactly 100 seconds have elapsed?"],"blockCodes":[["p=0,4 v=3,-3","p=6,3 v=-1,-3","p=10,3 v=-1,2","p=2,0 v=2,-1","p=0,0 v=1,3","p=3,0 v=-2,-2","p=7,6 v=-1,-3","p=3,0 v=-1,-2","p=9,3 v=2,3","p=7,3 v=-1,2","p=2,4 v=2,-3","p=9,5 v=-3,-3"],["1.12.......","...........","...........","......11.11","1.1........",".........1.",".......1..."],["Initial state:","...........","...........","...........","...........","..1........","...........","...........","","After 1 second:","...........","....1......","...........","...........","...........","...........","...........","","After 2 seconds:","...........","...........","...........","...........","...........","......1....","...........","","After 3 seconds:","...........","...........","........1..","...........","...........","...........","...........","","After 4 seconds:","...........","...........","...........","...........","...........","...........","..........1","","After 5 seconds:","...........","...........","...........",".1.........","...........","...........","..........."],["......2..1.","...........","1..........",".11........",".....1.....","...12......",".1....1...."],["..... 2..1.","..... .....","1.... .....","           ","..... .....","...12 .....",".1... 1...."]],"inlineCodes":["p","v","p=x,y","x","y","p=0,0","v=x,y","x","y","x","y","v=1,-2","1","2","101","103","11","7","p=2,4 v=2,-3","100","1","3","4","1","12","101","103"],"example":"p=0,4 v=3,-3\np=6,3 v=-1,-3\np=10,3 v=-1,2\np=2,0 v=2,-1\np=0,0 v=1,3\np=3,0 v=-2,-2\np=7,6 v=-1,-3\np=3,0 v=-1,-2\np=9,3 v=2,3\np=7,3 v=-1,2\np=2,4 v=2,-3\np=9,5 v=-3,-3\n"},{"year":"2024","day":"15","title":"Warehouse Woes","description":["You appear back inside your own mini submarine! Each Historian drives their mini submarine in a different direction; maybe the Chief has his own submarine down here somewhere as well?","You look up to see a vast school of lanternfish swimming past you. On closer inspection, they seem quite anxious, so you drive your mini submarine over to see if you can help.","Because lanternfish populations grow rapidly, they need a lot of food, and that food needs to be stored somewhere. That's why these lanternfish have built elaborate warehouse complexes operated by robots!","These lanternfish seem so anxious because they have lost control of the robot that operates one of their most important warehouses! It is currently running amok, pushing around boxes in the warehouse with no regard for lanternfish logistics or lanternfish inventory management strategies.","Right now, none of the lanternfish are brave enough to swim up to an unpredictable robot so they could shut it off. However, if you could anticipate the robot's movements, maybe they could find a safe option.","The lanternfish already have a map of the warehouse and a list of movements the robot will attempt to make (your puzzle input). The problem is that the movements will sometimes fail as boxes are shifted around, making the actual movements of the robot difficult to predict.","For example:","##########\n#..O..O.O#\n#......O.#\n#.OO..O.O#\n#..O@..O.#\n#O#..O...#\n#O..O..O.#\n#.OO.O.OO#\n#....O...#\n##########\n\n<vv>^<v^>v>^vv^v>v<>v^v<v<^vv<<<^><<><>>v<vvv<>^v^>^<<<><<v<<<v^vv^v>^\nvvv<<^>^v^^><<>>><>^<<><^vv^^<>vvv<>><^^v>^>vv<>v<<<<v<^v>^<^^>>>^<v<v\n><>vv>v^v^<>><>>>><^^>vv>v<^^^>>v^v^<^^>v^^>v^<^v>v<>>v^v^<v>v^^<^^vv<\n<<v<^>>^^^^>>>v^<>vvv^><v<<<>^^^vv^<vvv>^>v<^^^^v<>^>vvvv><>>v^<<^^^^^\n^><^><>>><>^^<<^^v>>><^<v>^<vv>>v>>>^v><>^v><<<<v>>v<v<v>vvv>^<><<>^><\n^>><>^v<><^vvv<^^<><v<<<<<><^v<<<><<<^^<v<^^^><^>>^<v^><<<^>>^v<v^v<v^\n>^>>^v>vv>^<<^v<>><<><<v<<v><>v<^vv<<<>^^v^>^^>>><<^v>>v^v><^^>>^<>vv^\n<><^^>^^^<><vvvvv^v<v<<>^v<v>v<<^><<><<><<<^^<<<^<<>><<><^^^>^^<>^>v<>\n^^>vv<^v^v<vv>^<><v<^v>^^^>>>^^vvv^>vvv<>>>^<^>>>>>^<<^v>^vvv<>^<><<v>\nv^^>>><<^^<>>^v^<v^vv<>v^<<>^<^v^v><^<<<><<^<v><v<>vv>>v><v^<vv<>v^<<^","As the robot (@) attempts to move, if there are any boxes (O) in the way, the robot will also attempt to push those boxes. However, if this action would cause the robot or a box to move into a wall (#), nothing moves instead, including the robot. The initial positions of these are shown on the map at the top of the document the lanternfish gave you.","The rest of the document describes the moves (^ for up, v for down, < for left, > for right) that the robot will attempt to make, in order. (The moves form a single giant sequence; they are broken into multiple lines just to make copy-pasting easier. Newlines within the move sequence should be ignored.)","Here is a smaller example to get started:","########\n#..O.O.#\n##@.O..#\n#...O..#\n#.#.O..#\n#...O..#\n#......#\n########\n\n<^^>>>vv<v>>v<<","Were the robot to attempt the given sequence of moves, it would push around the boxes as follows:","Initial state:\n########\n#..O.O.#\n##@.O..#\n#...O..#\n#.#.O..#\n#...O..#\n#......#\n########\n\nMove <:\n########\n#..O.O.#\n##@.O..#\n#...O..#\n#.#.O..#\n#...O..#\n#......#\n########\n\nMove ^:\n########\n#.@O.O.#\n##..O..#\n#...O..#\n#.#.O..#\n#...O..#\n#......#\n########\n\nMove ^:\n########\n#.@O.O.#\n##..O..#\n#...O..#\n#.#.O..#\n#...O..#\n#......#\n########\n\nMove >:\n########\n#..@OO.#\n##..O..#\n#...O..#\n#.#.O..#\n#...O..#\n#......#\n########\n\nMove >:\n########\n#...@OO#\n##..O..#\n#...O..#\n#.#.O..#\n#...O..#\n#......#\n########\n\nMove >:\n########\n#...@OO#\n##..O..#\n#...O..#\n#.#.O..#\n#...O..#\n#......#\n########\n\nMove v:\n########\n#....OO#\n##..@..#\n#...O..#\n#.#.O..#\n#...O..#\n#...O..#\n########\n\nMove v:\n########\n#....OO#\n##..@..#\n#...O..#\n#.#.O..#\n#...O..#\n#...O..#\n########\n\nMove <:\n########\n#....OO#\n##.@...#\n#...O..#\n#.#.O..#\n#...O..#\n#...O..#\n########\n\nMove v:\n########\n#....OO#\n##.....#\n#..@O..#\n#.#.O..#\n#...O..#\n#...O..#\n########\n\nMove >:\n########\n#....OO#\n##.....#\n#...@O.#\n#.#.O..#\n#...O..#\n#...O..#\n########\n\nMove >:\n########\n#....OO#\n##.....#\n#....@O#\n#.#.O..#\n#...O..#\n#...O..#\n########\n\nMove v:\n########\n#....OO#\n##.....#\n#.....O#\n#.#.O@.#\n#...O..#\n#...O..#\n########\n\nMove <:\n########\n#....OO#\n##.....#\n#.....O#\n#.#O@..#\n#...O..#\n#...O..#\n########\n\nMove <:\n########\n#....OO#\n##.....#\n#.....O#\n#.#O@..#\n#...O..#\n#...O..#\n########","The larger example has many more moves; after the robot has finished those moves, the warehouse would look like this:","##########\n#.O.O.OOO#\n#........#\n#OO......#\n#OO@.....#\n#O#.....O#\n#O.....OO#\n#O.....OO#\n#OO....OO#\n##########","The lanternfish use their own custom Goods Positioning System (GPS for short) to track the locations of the boxes. The GPS coordinate of a box is equal to 100 times its distance from the top edge of the map plus its distance from the left edge of the map. (This process does not stop at wall tiles; measure all the way to the edges of the map.)","So, the box shown below has a distance of 1 from the top edge of the map and 4 from the left edge of the map, resulting in a GPS coordinate of 100 * 1 + 4 = 104.","#######\n#...O..\n#......","The lanternfish would like to know the sum of all boxes' GPS coordinates after the robot finishes moving. In the larger example, the sum of all boxes' GPS coordinates is 10092. In the smaller example, the sum is 2028.","Predict the motion of the robot and boxes in the warehouse. After the robot is finished moving, what is the sum of all boxes' GPS coordinates?"],"blockCodes":[["##########","#..O..O.O#","#......O.#","#.OO..O.O#","#..O@..O.#","#O#..O...#","#O..O..O.#","#.OO.O.OO#","#....O...#","##########","","<vv>^<v^>v>^vv^v>v<>v^v<v<^vv<<<^><<><>>v<vvv<>^v^>^<<<><<v<<<v^vv^v>^","vvv<<^>^v^^><<>>><>^<<><^vv^^<>vvv<>><^^v>^>vv<>v<<<<v<^v>^<^^>>>^<v<v","><>vv>v^v^<>><>>>><^^>vv>v<^^^>>v^v^<^^>v^^>v^<^v>v<>>v^v^<v>v^^<^^vv<","<<v<^>>^^^^>>>v^<>vvv^><v<<<>^^^vv^<vvv>^>v<^^^^v<>^>vvvv><>>v^<<^^^^^","^><^><>>><>^^<<^^v>>><^<v>^<vv>>v>>>^v><>^v><<<<v>>v<v<v>vvv>^<><<>^><","^>><>^v<><^vvv<^^<><v<<<<<><^v<<<><<<^^<v<^^^><^>>^<v^><<<^>>^v<v^v<v^",">^>>^v>vv>^<<^v<>><<><<v<<v><>v<^vv<<<>^^v^>^^>>><<^v>>v^v><^^>>^<>vv^","<><^^>^^^<><vvvvv^v<v<<>^v<v>v<<^><<><<><<<^^<<<^<<>><<><^^^>^^<>^>v<>","^^>vv<^v^v<vv>^<><v<^v>^^^>>>^^vvv^>vvv<>>>^<^>>>>>^<<^v>^vvv<>^<><<v>","v^^>>><<^^<>>^v^<v^vv<>v^<<>^<^v^v><^<<<><<^<v><v<>vv>>v><v^<vv<>v^<<^"],["########","#..O.O.#","##@.O..#","#...O..#","#.#.O..#","#...O..#","#......#","########","","<^^>>>vv<v>>v<<"],["Initial state:","########","#..O.O.#","##@.O..#","#...O..#","#.#.O..#","#...O..#","#......#","########","","Move <:","########","#..O.O.#","##@.O..#","#...O..#","#.#.O..#","#...O..#","#......#","########","","Move ^:","########","#.@O.O.#","##..O..#","#...O..#","#.#.O..#","#...O..#","#......#","########","","Move ^:","########","#.@O.O.#","##..O..#","#...O..#","#.#.O..#","#...O..#","#......#","########","","Move >:","########","#..@OO.#","##..O..#","#...O..#","#.#.O..#","#...O..#","#......#","########","","Move >:","########","#...@OO#","##..O..#","#...O..#","#.#.O..#","#...O..#","#......#","########","","Move >:","########","#...@OO#","##..O..#","#...O..#","#.#.O..#","#...O..#","#......#","########","","Move v:","########","#....OO#","##..@..#","#...O..#","#.#.O..#","#...O..#","#...O..#","########","","Move v:","########","#....OO#","##..@..#","#...O..#","#.#.O..#","#...O..#","#...O..#","########","","Move <:","########","#....OO#","##.@...#","#...O..#","#.#.O..#","#...O..#","#...O..#","########","","Move v:","########","#....OO#","##.....#","#..@O..#","#.#.O..#","#...O..#","#...O..#","########","","Move >:","########","#....OO#","##.....#","#...@O.#","#.#.O..#","#...O..#","#...O..#","########","","Move >:","########","#....OO#","##.....#","#....@O#","#.#.O..#","#...O..#","#...O..#","########","","Move v:","########","#....OO#","##.....#","#.....O#","#.#.O@.#","#...O..#","#...O..#","########","","Move <:","########","#....OO#","##.....#","#.....O#","#.#O@..#","#...O..#","#...O..#","########","","Move <:","########","#....OO#","##.....#","#.....O#","#.#O@..#","#...O..#","#...O..#","########"],["##########","#.O.O.OOO#","#........#","#OO......#","#OO@.....#","#O#.....O#","#O.....OO#","#O.....OO#","#OO....OO#","##########"],["#######","#...O..","#......"]],"inlineCodes":["@","O","#","^","v","<",">","1","4","100 * 1 + 4 = 104","10092","2028"],"example":"##########\n#..O..O.O#\n#......O.#\n#.OO..O.O#\n#..O@..O.#\n#O#..O...#\n#O..O..O.#\n#.OO.O.OO#\n#....O...#\n##########\n\n<vv>^<v^>v>^vv^v>v<>v^v<v<^vv<<<^><<><>>v<vvv<>^v^>^<<<><<v<<<v^vv^v>^\nvvv<<^>^v^^><<>>><>^<<><^vv^^<>vvv<>><^^v>^>vv<>v<<<<v<^v>^<^^>>>^<v<v\n><>vv>v^v^<>><>>>><^^>vv>v<^^^>>v^v^<^^>v^^>v^<^v>v<>>v^v^<v>v^^<^^vv<\n<<v<^>>^^^^>>>v^<>vvv^><v<<<>^^^vv^<vvv>^>v<^^^^v<>^>vvvv><>>v^<<^^^^^\n^><^><>>><>^^<<^^v>>><^<v>^<vv>>v>>>^v><>^v><<<<v>>v<v<v>vvv>^<><<>^><\n^>><>^v<><^vvv<^^<><v<<<<<><^v<<<><<<^^<v<^^^><^>>^<v^><<<^>>^v<v^v<v^\n>^>>^v>vv>^<<^v<>><<><<v<<v><>v<^vv<<<>^^v^>^^>>><<^v>>v^v><^^>>^<>vv^\n<><^^>^^^<><vvvvv^v<v<<>^v<v>v<<^><<><<><<<^^<<<^<<>><<><^^^>^^<>^>v<>\n^^>vv<^v^v<vv>^<><v<^v>^^^>>>^^vvv^>vvv<>>>^<^>>>>>^<<^v>^vvv<>^<><<v>\nv^^>>><<^^<>>^v^<v^vv<>v^<<>^<^v^v><^<<<><<^<v><v<>vv>>v><v^<vv<>v^<<^\n"},{"year":"2024","day":"16","title":"Reindeer Maze","description":["It's time again for the Reindeer Olympics! This year, the big event is the Reindeer Maze, where the Reindeer compete for the lowest score.","You and The Historians arrive to search for the Chief right as the event is about to start. It wouldn't hurt to watch a little, right?","The Reindeer start on the Start Tile (marked S) facing East and need to reach the End Tile (marked E). They can move forward one tile at a time (increasing their score by 1 point), but never into a wall (#). They can also rotate clockwise or counterclockwise 90 degrees at a time (increasing their score by 1000 points).","To figure out the best place to sit, you start by grabbing a map (your puzzle input) from a nearby kiosk. For example:","###############\n#.......#....E#\n#.#.###.#.###.#\n#.....#.#...#.#\n#.###.#####.#.#\n#.#.#.......#.#\n#.#.#####.###.#\n#...........#.#\n###.#.#####.#.#\n#...#.....#.#.#\n#.#.#.###.#.#.#\n#.....#...#.#.#\n#.###.#.#.#.#.#\n#S..#.....#...#\n###############","There are many paths through this maze, but taking any of the best paths would incur a score of only 7036. This can be achieved by taking a total of 36 steps forward and turning 90 degrees a total of 7 times:","###############\n#.......#....E#\n#.#.###.#.###^#\n#.....#.#...#^#\n#.###.#####.#^#\n#.#.#.......#^#\n#.#.#####.###^#\n#..>>>>>>>>v#^#\n###^#.#####v#^#\n#>>^#.....#v#^#\n#^#.#.###.#v#^#\n#^....#...#v#^#\n#^###.#.#.#v#^#\n#S..#.....#>>^#\n###############","Here's a second example:","#################\n#...#...#...#..E#\n#.#.#.#.#.#.#.#.#\n#.#.#.#...#...#.#\n#.#.#.#.###.#.#.#\n#...#.#.#.....#.#\n#.#.#.#.#.#####.#\n#.#...#.#.#.....#\n#.#.#####.#.###.#\n#.#.#.......#...#\n#.#.###.#####.###\n#.#.#...#.....#.#\n#.#.#.#####.###.#\n#.#.#.........#.#\n#.#.#.#########.#\n#S#.............#\n#################","In this maze, the best paths cost 11048 points; following one such path would look like this:","#################\n#...#...#...#..E#\n#.#.#.#.#.#.#.#^#\n#.#.#.#...#...#^#\n#.#.#.#.###.#.#^#\n#>>v#.#.#.....#^#\n#^#v#.#.#.#####^#\n#^#v..#.#.#>>>>^#\n#^#v#####.#^###.#\n#^#v#..>>>>^#...#\n#^#v###^#####.###\n#^#v#>>^#.....#.#\n#^#v#^#####.###.#\n#^#v#^........#.#\n#^#v#^#########.#\n#S#>>^..........#\n#################","Note that the path shown above includes one 90 degree turn as the very first move, rotating the Reindeer from facing East to facing North.","Analyze your map carefully. What is the lowest score a Reindeer could possibly get?"],"blockCodes":[["###############","#.......#....E#","#.#.###.#.###.#","#.....#.#...#.#","#.###.#####.#.#","#.#.#.......#.#","#.#.#####.###.#","#...........#.#","###.#.#####.#.#","#...#.....#.#.#","#.#.#.###.#.#.#","#.....#...#.#.#","#.###.#.#.#.#.#","#S..#.....#...#","###############"],["###############","#.......#....E#","#.#.###.#.###^#","#.....#.#...#^#","#.###.#####.#^#","#.#.#.......#^#","#.#.#####.###^#","#..>>>>>>>>v#^#","###^#.#####v#^#","#>>^#.....#v#^#","#^#.#.###.#v#^#","#^....#...#v#^#","#^###.#.#.#v#^#","#S..#.....#>>^#","###############"],["#################","#...#...#...#..E#","#.#.#.#.#.#.#.#.#","#.#.#.#...#...#.#","#.#.#.#.###.#.#.#","#...#.#.#.....#.#","#.#.#.#.#.#####.#","#.#...#.#.#.....#","#.#.#####.#.###.#","#.#.#.......#...#","#.#.###.#####.###","#.#.#...#.....#.#","#.#.#.#####.###.#","#.#.#.........#.#","#.#.#.#########.#","#S#.............#","#################"],["#################","#...#...#...#..E#","#.#.#.#.#.#.#.#^#","#.#.#.#...#...#^#","#.#.#.#.###.#.#^#","#>>v#.#.#.....#^#","#^#v#.#.#.#####^#","#^#v..#.#.#>>>>^#","#^#v#####.#^###.#","#^#v#..>>>>^#...#","#^#v###^#####.###","#^#v#>>^#.....#.#","#^#v#^#####.###.#","#^#v#^........#.#","#^#v#^#########.#","#S#>>^..........#","#################"]],"inlineCodes":["S","E","1","#","1000","7036","36","7","11048"],"example":"###############\n#.......#....E#\n#.#.###.#.###.#\n#.....#.#...#.#\n#.###.#####.#.#\n#.#.#.......#.#\n#.#.#####.###.#\n#...........#.#\n###.#.#####.#.#\n#...#.....#.#.#\n#.#.#.###.#.#.#\n#.....#...#.#.#\n#.###.#.#.#.#.#\n#S..#.....#...#\n###############\n"},{"year":"2024","day":"17","title":"Chronospatial Computer","description":["The Historians push the button on their strange device, but this time, you all just feel like you're falling.","\"Situation critical\", the device announces in a familiar voice. \"Bootstrapping process failed. Initializing debugger....\"","The small handheld device suddenly unfolds into an entire computer! The Historians look around nervously before one of them tosses it to you.","This seems to be a 3-bit computer: its program is a list of 3-bit numbers (0 through 7), like 0,1,2,3. The computer also has three registers named A, B, and C, but these registers aren't limited to 3 bits and can instead hold any integer.","The computer knows eight instructions, each identified by a 3-bit number (called the instruction's opcode). Each instruction also reads the 3-bit number after it as an input; this is called its operand.","A number called the instruction pointer identifies the position in the program from which the next opcode will be read; it starts at 0, pointing at the first 3-bit number in the program. Except for jump instructions, the instruction pointer increases by 2 after each instruction is processed (to move past the instruction's opcode and its operand). If the computer tries to read an opcode past the end of the program, it instead halts.","So, the program 0,1,2,3 would run the instruction whose opcode is 0 and pass it the operand 1, then run the instruction having opcode 2 and pass it the operand 3, then halt.","There are two types of operands; each instruction specifies the type of its operand. The value of a literal operand is the operand itself. For example, the value of the literal operand 7 is the number 7. The value of a combo operand can be found as follows:","Combo operands 0 through 3 represent literal values 0 through 3.\nCombo operand 4 represents the value of register A.\nCombo operand 5 represents the value of register B.\nCombo operand 6 represents the value of register C.\nCombo operand 7 is reserved and will not appear in valid programs.","The eight instructions are as follows:","The adv instruction (opcode 0) performs division. The numerator is the value in the A register. The denominator is found by raising 2 to the power of the instruction's combo operand. (So, an operand of 2 would divide A by 4 (2^2); an operand of 5 would divide A by 2^B.) The result of the division operation is truncated to an integer and then written to the A register.","The bxl instruction (opcode 1) calculates the bitwise XOR of register B and the instruction's literal operand, then stores the result in register B.","The bst instruction (opcode 2) calculates the value of its combo operand modulo 8 (thereby keeping only its lowest 3 bits), then writes that value to the B register.","The jnz instruction (opcode 3) does nothing if the A register is 0. However, if the A register is not zero, it jumps by setting the instruction pointer to the value of its literal operand; if this instruction jumps, the instruction pointer is not increased by 2 after this instruction.","The bxc instruction (opcode 4) calculates the bitwise XOR of register B and register C, then stores the result in register B. (For legacy reasons, this instruction reads an operand but ignores it.)","The out instruction (opcode 5) calculates the value of its combo operand modulo 8, then outputs that value. (If a program outputs multiple values, they are separated by commas.)","The bdv instruction (opcode 6) works exactly like the adv instruction except that the result is stored in the B register. (The numerator is still read from the A register.)","The cdv instruction (opcode 7) works exactly like the adv instruction except that the result is stored in the C register. (The numerator is still read from the A register.)","Here are some examples of instruction operation:","If register C contains 9, the program 2,6 would set register B to 1.\nIf register A contains 10, the program 5,0,5,1,5,4 would output 0,1,2.\nIf register A contains 2024, the program 0,1,5,4,3,0 would output 4,2,5,6,7,7,7,7,3,1,0 and leave 0 in register A.\nIf register B contains 29, the program 1,7 would set register B to 26.\nIf register B contains 2024 and register C contains 43690, the program 4,0 would set register B to 44354.","The Historians' strange device has finished initializing its debugger and is displaying some information about the program it is trying to run (your puzzle input). For example:","Register A: 729\nRegister B: 0\nRegister C: 0\n\nProgram: 0,1,5,4,3,0","Your first task is to determine what the program is trying to output. To do this, initialize the registers to the given values, then run the given program, collecting any output produced by out instructions. (Always join the values produced by out instructions with commas.) After the above program halts, its final output will be 4,6,3,5,6,3,5,2,1,0.","Using the information provided by the debugger, initialize the registers to the given values, then run the program. Once it halts, what do you get if you use commas to join the values it output into a single string?"],"blockCodes":[["Register A: 729","Register B: 0","Register C: 0","","Program: 0,1,5,4,3,0"]],"inlineCodes":["0,1,2,3","A","B","C","0","2","0,1,2,3","0","1","2","3","7","7","0","3","0","3","4","A","5","B","6","C","7","adv","0","A","2","A","4","2^2","5","A","2^B","A","bxl","1","B","B","bst","2","B","jnz","3","A","0","A","2","bxc","4","B","C","B","out","5","bdv","6","adv","B","A","cdv","7","adv","C","A","C","9","2,6","B","1","A","10","5,0,5,1,5,4","0,1,2","A","2024","0,1,5,4,3,0","4,2,5,6,7,7,7,7,3,1,0","0","A","B","29","1,7","B","26","B","2024","C","43690","4,0","B","44354","out","out","4,6,3,5,6,3,5,2,1,0"],"example":"Register A: 729\nRegister B: 0\nRegister C: 0\n\nProgram: 0,1,5,4,3,0\n"}]